---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PlacementCenterX
source: html/64e1ad58-a339-f966-4ec6-1daea0c4112c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PlacementCenterX Property

"Center X"

## Syntax (C#)
```csharp
public static ForgeTypeId PlacementCenterX { get; }
```